app/Controllers/Api/ChatApi.php

    public function messages($roomId)
    {
        if (!$this->request->user) {
            return json_response(null, 401, 'Unauthorized');
        }

        $userId = $this->request->user->sub;

        $room = (new ChatRoomModel())->find($roomId);
        if (!$room) {
            return json_response(null, 404, 'Room tidak ditemukan');
        }

        if ($room['user_id'] != $userId) {
            return json_response(null, 403, 'Akses ditolak');
        }

        $messages = (new ChatMessageModel())
            ->where('room_id', $roomId)
            ->orderBy('created_at', 'ASC')
            ->findAll();
---
SELECT *
FROM `chat_rooms`
WHERE `chat_rooms`.`id` = '19'
SELECT *
FROM `chat_messages`
WHERE `room_id` = '19'
ORDER BY `created_at` ASC