app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows` FROM `promo`
---
    public function index()
    {
        $data = [
            'title' => 'Admin Dashboard',
            'total_fields' => $this->fieldModel->countAll(),
            'total_promos' => $this->promoModel->countAll()