app/Controllers/Booking.php

INSERT INTO `booking` (`name`, `user_id`, `venue_id`, `booking_date`, `start_time`, `end_time`, `total_price`, `status`) VALUES ('hafizh', '1', '1', '2026-01-01', '14:00:00', '15:00:00', '132000', 'Success')
---
    public function save()
    {
        // --- LOGIKA LAMA (Menyiapkan Data Booking) ---
        $inputDiskon = $this->request->getPost('discount_amount');
        if(empty($inputDiskon)) {
            $inputDiskon = 0;
        }

        $userId  = $this->request->getPost('id_user');
        $venueId = $this->request->getPost('venue_id');

        $data = [
            'user_id'         => $userId,
            'venue_id'        => $venueId,
            'booking_date'    => $this->request->getPost('jadwal'),
            'start_time'      => $this->request->getPost('mulai'),
            'end_time'        => $this->request->getPost('selesai'),
            'status'          => 'pending',
            'pembayaran'      => $this->request->getPost('pembayaran'),
            'total_price'     => $this->request->getPost('total'),
            'discount_amount' => $inputDiskon,
            'promo_code'      => $this->request->getPost('kodepromo'),
        ];

        // Simpan Booking
        $bookingModel = new BookingModel();
        $bookingModel->save($data);

SELECT *
FROM `booking`
WHERE `venue_id` = '5'
AND `booking_date` = '2025-12-22'
AND `status` != 'cancel'
---
    public function checkAvailability()
    {
        $venueId = $this->request->getGet('venue_id');
        $date    = $this->request->getGet('date');

        $bookingModel = new \App\Models\BookingModel();

        $bookings = $bookingModel
            ->where('venue_id', $venueId)
            ->where('booking_date', $date)
            ->where('status !=', 'cancel')
            ->findAll();