app/Controllers/Chat.php

    public function apiGetMessages($roomId)
    {
        // Validasi Login
        if (!user()) {
            return $this->response->setJSON([]);
        }

        // Ambil pesan urut dari yang terlama ke terbaru
        $messages = $this->chatMessageModel
            ->where('room_id', $roomId)
            ->orderBy('created_at', 'ASC')
            ->findAll();
---
SELECT *
FROM `chat_messages`
WHERE `room_id` = '12'
ORDER BY `created_at` ASC