app/Controllers/Home.php

    public function index()
    {

        if (logged_in()) {

            if (in_groups('admin')) {
                return redirect()->to('/admin');
            }


            if (in_groups('mitra')) {
                return redirect()->to('/owner');
            }


        }

        $fieldModel = new FieldModel();
        $promoModel = new PromoModel();

        $data = [
            'title'  => 'Home | SportSpace',
            'fields' => $fieldModel->paginate(6),
            'pager'  => $fieldModel->pager,
            'promos' => $promoModel->orderBy('id', 'DESC')->findAll(3)
---
SELECT *
FROM `promo`
ORDER BY `id` DESC
 LIMIT 3