app/Controllers/OwnerChatController.php

    private function getChatListRaw($ownerId)
    {
        return $this->chatModel
            ->select('chat_messages.*,
                      u_sender.username as sender_name, u_sender.profile_picture as sender_pic,
                      u_target.username as target_name, u_target.profile_picture as target_pic')
            ->join('users u_sender', 'u_sender.id = chat_messages.sender_id')
            ->join('users u_target', 'u_target.id = chat_messages.receiver_id')
            ->whereIn('chat_messages.id', function($builder) use ($ownerId) {
                return $builder->select('MAX(id)')
                               ->from('chat_messages')
                               ->where('receiver_id', $ownerId)
                               ->orWhere('sender_id', $ownerId)
                               ->groupBy('room_id');
            })
            ->orderBy('chat_messages.created_at', 'DESC')
            ->findAll();
---
SELECT `chat_messages`.*, `u_sender`.`username` as `sender_name`, `u_sender`.`profile_picture` as `sender_pic`, `u_target`.`username` as `target_name`, `u_target`.`profile_picture` as `target_pic`
FROM `chat_messages`
JOIN `users` `u_sender` ON `u_sender`.`id` = `chat_messages`.`sender_id`
JOIN `users` `u_target` ON `u_target`.`id` = `chat_messages`.`receiver_id`
WHERE `chat_messages`.`id` IN (SELECT MAX(id) FROM `chat_messages` WHERE `receiver_id` = '9' OR `sender_id` = '9' GROUP BY `room_id`)
ORDER BY `chat_messages`.`created_at` DESC