app/Controllers/Promo.php

SELECT *
FROM `promo`
---
    public function showPromo()
    {
        $data['promo'] = $this->PromoModel->findAll();